trade/src/Catalogs/ОфлайнОборудование/ОфлайнОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОфлайнОборудование</name>
  <attributes>
    <name>ОбработчикОфлайнОборудования</name>
    <type>
      <types>EnumRef.ОбработчикиОфлайнОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWebСервисОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОфлайнОборудования</name>
    <type>
      <types>EnumRef.ТипыОфлайнОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключенияОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключенияОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортаОфлайнОбмена</name>
    <type>
      <types>EnumRef.ВидыТранспортаОфлайнОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Enums/ТипыПодключенияОборудования/ТипыПодключенияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключенияОборудования</name>
  <enumValues>
    <name>ЛокальноеПодключение</name>
  </enumValues>
  <enumValues>
    <name>ОбщийДоступ</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ОбработчикиОфлайнОборудования/ОбработчикиОфлайнОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиОфлайнОборудования</name>
  <enumValues>
    <name>Обработчик1СККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>Обработчик1СЭвоторККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМККМОфлайн</name>
  </enumValues>
  <enumValues>
    <name>Обработчик1СККМED</name>
  </enumValues>
  <enumValues>
    <name>ОбработчикОФД</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ОфлайнОборудование/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СозданиеНовогоЭлемента = Объект.Ссылка = Справочники.ОфлайнОборудование.ПустаяСсылка();
	// Защита от изменения уже созданного экземпляра устройства.
	Элементы.ОбработчикОфлайнОборудования.ТолькоПросмотр = НЕ СозданиеНовогоЭлемента;
	Элементы.ОбработчикОфлайнОборудования.КнопкаОткрытия = Не СозданиеНовогоЭлемента;
	Элементы.ТипОборудования.ТолькоПросмотр = НЕ СозданиеНовогоЭлемента;
	Элементы.ТипОборудования.КнопкаОткрытия = Не СозданиеНовогоЭлемента;
	
	Если СозданиеНовогоЭлемента Тогда 
		Если ПустаяСтрока(Объект.РабочееМесто) Тогда
			Объект.РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		КонецЕсли;
		Элементы.ПараметрыПодключения.Видимость = Ложь;
	КонецЕсли;
	
	ПроверкаПараметров = СозданиеНовогоЭлемента;
	
#Если МобильноеПриложениеСервер Тогда
	Элементы.РабочееМесто.Видимость = Ложь;
	Элементы.ПараметрыПодключения.Видимость = Ложь;
	Элементы.ТипПодключения.Видимость = Ложь;
#Иначе
	Если Объект.ТипПодключенияОборудования = Перечисления.ТипыПодключенияОборудования.ЛокальноеПодключение Тогда
		Элементы.РабочееМесто.Видимость = Истина;
	Иначе
		Элементы.РабочееМесто.Видимость = Ложь;
	КонецЕсли;
#КонецЕсли
	
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.Наименование);
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.РабочееМесто);
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ОбработчикОфлайнОборудования);
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриСозданииНаСервере(Объект, ЭтотОбъект, Отказ, Параметры, СтандартнаяОбработка);
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначенияБПО.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтотОбъект);
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияБПО.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияБПОКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияПередЗаписью(Объект, ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыУстройства = МенеджерОфлайнОборудованияВызовСервера.ПараметрыУстройства(Объект.Ссылка);
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СозданиеНовогоЭлемента = Ложь;
	
	Элементы.ПараметрыПодключения.Видимость = НЕ СозданиеНовогоЭлемента;
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияПослеЗаписи(Объект, ЭтотОбъект, ПараметрыЗаписи);
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияБПОКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключения(Команда)
	
	Если СозданиеНовогоЭлемента Или Модифицированность Тогда
		Если Записать() Тогда
			ПроверкаПараметров = Ложь;
			Закрыть();
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ПроверкаПараметров = Ложь;
		Закрыть();
	КонецЕсли;
	
	МенеджерОфлайнОборудованияКлиент.ВыполнитьНастройкуОборудования(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияОбработкаНавигационнойСсылки(Объект, ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Если ПроверкаПараметров Тогда
			Отказ = Истина;
			Текст = НСтр("ru = 'Для использования устройства необходимо настроить параметры подключения.
			|Перейти к настройке параметров подключения?'");
			Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",  ЭтотОбъект);
			ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОбработчикОфлайнОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Объект.ОбработчикОфлайнОборудования Тогда
		Объект.Наименование = НСтр("ru='Оборудование'") + " '" + Строка(ВыбранноеЗначение) + "'";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Объект.ТипОфлайнОборудования <> ВыбранноеЗначение Тогда
		Объект.ТипОфлайнОборудования = ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	НастроитьДрайвераОфлайнОборудования();
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияТипОборудованияВыбор(Объект, ЭтотОбъект, ЭтотОбъект, Элемент, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Модифицированность Или СозданиеНовогоЭлемента Тогда
			Если Записать() Тогда
				ПроверкаПараметров = Ложь;
				Закрыть();
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			ПроверкаПараметров = Ложь;
			Закрыть();
		КонецЕсли;
		МенеджерОфлайнОборудованияКлиент.ВыполнитьНастройкуОборудования(Объект.Ссылка);
	Иначе
		ПроверкаПараметров = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДрайвераОфлайнОборудования()
	
	ТипККМ = Перечисления["ТипыОфлайнОборудования"].ККМ;
	ТипПрайсЧекер = Перечисления["ТипыОфлайнОборудования"].ПрайсЧекер;
	ТипОФД = Перечисления["ТипыОфлайнОборудования"].ОФД;
	Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Очистить();
	
	Если Объект.ТипОфлайнОборудования = ТипККМ Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СЭвоторККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикАтолККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикШтрихМККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМED);
	ИначеЕсли Объект.ТипОфлайнОборудования = ТипПрайсЧекер Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн);
	ИначеЕсли Объект.ТипОфлайнОборудования = ТипОФД Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикОФД);
	Иначе
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	// Вызов БСП
	Если ОбщегоНазначенияБПОКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры)
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	// Вызов БСП
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначенияБПО.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	// Вызов БСП
	Если ОбщегоНазначенияБПОКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
